Revit 2026 API

# SpatialElementType Enumeration

---

An enumerated type listing types of spaces.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SpatialElementType
```
```vb
Public Enumeration SpatialElementType
```
```cpp
public enum class SpatialElementType
```
```fsharp
type SpatialElementType
```

| Member name | Value | Description |
| --- | --- | --- |
| Area | 2 | Area |
| ElectricalLoadArea | 4 | Electrical Load Area |
| Room | 1 | Room |
| Space | 3 | Space |

#### Reference

Autodesk.Revit.DB Namespace